Статистика работы механизмов/Конфигурация/DataProcessors/_СверкаСБанком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_СверкаСБанком</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьСчетаУчетКоторыхВедетсяВДругойСистеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КаталогиСверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Каталог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БанковскиеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>35</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатСверки</Name>
							<Comment>Значения перечислены в соответствии РезультатыСверки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расход</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйОстатокБанк</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходБанк</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходБанк</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйОстатокБанк</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_СверкаСБанком/Forms/ФормаСохраненияРезультатовСверки/Ext/Form/Module.bsl
#Область События_формы_и_элементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	КопироватьДанныеФормы(ЭтаФорма.Параметры.Объект, ЭтаФорма.Объект);
	
	ЭтаФорма.ВремяСверки = ТекущаяДата();	
	
	ЗаполнитьРезультатыСверкиСчетовВнутреннегоУчетаНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	Если ЭтаФорма.СкрытьРанееСверенные Тогда
		СкрытьРанееСверенныеНаСервере();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СчетаВнутреннегоУчетаПослеУдаления(Элемент)
	
	ПересчитатьИтогиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаВнутреннегоУчетаПройденаПриИзменении(Элемент)

	ТекущаяТаблица	= ЭтаФорма.ТекущийЭлемент;
	Пройдена		= ТекущаяТаблица.ТекущиеДанные.Пройдена;
	
	Для Каждого ВыделеннаяСтрока Из ТекущаяТаблица.ВыделенныеСтроки Цикл
		
		СтрокаСверки = ЭтаФорма.СчетаВнутреннегоУчета.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		СтрокаСверки.Пройдена	 = Пройдена;
		СтрокаСверки.РучнойРежим = (СтрокаСверки.Пройдена <> СтрокаСверки.ПройденаАвто ИЛИ СтрокаСверки.РучнойРежимАвто);
		
		ЗаполнитьПримечание(СтрокаСверки);
		
	КонецЦикла;
	
	ПересчитатьИтогиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяСверкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ВыбранноеЗначение = ВыбранноеЗначение + (ЭтаФорма.ВремяСверки - НачалоДня(ЭтаФорма.ВремяСверки));		
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяСверкиПриИзменении(Элемент)
	
	Если ЭтаФорма.СкрытьРанееСверенные Тогда
		СкрытьРанееСверенныеНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьРанееСверенныеПриИзменении(Элемент)

	СкрытьРанееСверенныеНаСервере();	
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	ИзменитьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	ИзменитьФлажки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьРезультатыСверки(Команда)

	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	КонецСледующегоРабочегоДня = КонецДня(РаботаСДокументами.СледующийРабочийДень(Объект.Период.ДатаНачала));	
	
	Если ЭтаФорма.ВремяСверки > КонецСледующегоРабочегоДня Тогда		
		Если Вопрос("Время сверки позже, чем следующий рабочий день после сверяемого дня. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	ИначеЕсли ЭтаФорма.ВремяСверки < НачалоДня(КонецСледующегоРабочегоДня) Тогда
		Если Вопрос("Время сверки раньше, чем следующий рабочий день после сверяемого дня. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ИтогоНеСверено <> 0 Тогда		
		Если Вопрос("Найдены несверенные счета внутреннего учета. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СохранитьРезультатыСверкиНаСервере();	
	
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_и_вспомогательные_функции

&НаСервере
Процедура ЗаполнитьРезультатыСверкиСчетовВнутреннегоУчетаНаСервере()

	ОписаниеРезультатовСверки = РеквизитФормыВЗначение("Объект").ВариантыЗначенийРезультатаСверки();
	
	#Область Запрос_результатов_сверки
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Депозитный вклад"" КАК ТипОстатка,
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.Организация КАК Организация,
		|	ДенежныеСредстваВКредитныхИнструментахОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДепозитныеВклады.БанковскийСчет КАК БанковскийСчет
		|ПОМЕСТИТЬ _ВсеБанковскиеСчетаСчетовВнутреннегоУчета
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			ДЕНЬ,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)) КАК ДенежныеСредстваВКредитныхИнструментахОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|		ПО (ДепозитныеВклады.Ссылка = ДенежныеСредстваВКредитныхИнструментахОстатки.КредитныйИнструмент)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Расчетный счет"",
		|	ОстаткиДенежныхСредствОстатки.Организация,
		|	ОстаткиДенежныхСредствОстатки.СчетДоверительногоУправления,
		|	ОстаткиДенежныхСредствОстатки.РасчетныйСчет
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			ДЕНЬ,
		|			ДвиженияИГраницыПериода,
		|			Организация = &Организация
		|				И Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)) КАК ОстаткиДенежныхСредствОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Транзитный счет"",
		|	ДенежныеСредстваПереданныеВОплатуПаев.Организация,
		|	ДенежныеСредстваПереданныеВОплатуПаев.СчетДоверительногоУправления,
		|	ДенежныеСредстваПереданныеВОплатуПаев.РасчетныйСчет
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваПереданныеВОплатуПаев.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, ДЕНЬ, ДвиженияИГраницыПериода, Организация = &Организация) КАК ДенежныеСредстваПереданныеВОплатуПаев
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Расчетный счет"",
		|	ИсполнителиПоДенежнымСредствамСобственные.Организация,
		|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления,
		|	ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет
		|ИЗ
		|	РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|ГДЕ
		|	ИсполнителиПоДенежнымСредствамСобственные.Организация = &Организация
		|	И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия > &НачалоПериода
		|			ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
		|	И ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет.ДатаОткрытия <= &КонецПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	БанковскийСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВсеБанковскиеСчетаСчетовВнутреннегоУчета.ТипОстатка КАК ТипОстатка,
		|	_ВсеБанковскиеСчетаСчетовВнутреннегоУчета.Организация КАК Организация,
		|	_ВсеБанковскиеСчетаСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ВсеБанковскиеСчетаСчетовВнутреннегоУчета.БанковскийСчет КАК БанковскийСчет
		|ПОМЕСТИТЬ _БанковскиеСчетаСчетовВнутреннегоУчета
		|ИЗ
		|	_ВсеБанковскиеСчетаСчетовВнутреннегоУчета КАК _ВсеБанковскиеСчетаСчетовВнутреннегоУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО (СчетаДоверительногоУправления.Ссылка = _ВсеБанковскиеСчетаСчетовВнутреннегоУчета.СчетДоверительногоУправления)
		|			И (СчетаДоверительногоУправления.ПометкаУдаления = ЛОЖЬ)
		|			И (СчетаДоверительногоУправления.ДатаЗаключения <= &КонецПериода)
		|			И (СчетаДоверительногоУправления.ДатаРасторжения > &НачалоПериода
		|				ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|			И (НЕ СчетаДоверительногоУправления.КодСчета В (&КодыИсключаемыхПортфелей))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК СчетаУчетКоторыхВедетсяВДругойСистеме
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеСведения КАК СвойствоУчетНеВедется
		|			ПО (СвойствоУчетНеВедется.Ссылка = СчетаУчетКоторыхВедетсяВДругойСистеме.Свойство)
		|				И (СвойствоУчетНеВедется.Ключ = ""УчетНеВедется"")
		|		ПО (СчетаУчетКоторыхВедетсяВДругойСистеме.Объект = _ВсеБанковскиеСчетаСчетовВнутреннегоУчета.БанковскийСчет)
		|			И (СчетаУчетКоторыхВедетсяВДругойСистеме.Значение = ИСТИНА)
		|ГДЕ
		|	(НЕ &ИсключитьСчетаУчетКоторыхВедетсяВДругойСистеме
		|			ИЛИ СчетаУчетКоторыхВедетсяВДругойСистеме.Объект ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеСчета.БанковскийСчет КАК БанковскийСчет,
		|	БанковскиеСчета.РезультатСверки КАК РезультатСверки,
		|	БанковскиеСчета.РезультатСверкиАвто КАК РезультатСверкиАвто
		|ПОМЕСТИТЬ _БанковскиеСчета
		|ИЗ
		|	&БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(БанковскиеСчета.БанковскийСчет) = ТИП(Справочник.БанковскиеСчета)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВариантыРезультатовСверки.Значение КАК Значение,
		|	ВариантыРезультатовСверки.Представление КАК Представление,
		|	ВариантыРезультатовСверки.Приоритет КАК Приоритет,
		|	ВариантыРезультатовСверки.ЦветТекста КАК ЦветТекста
		|ПОМЕСТИТЬ _ВариантыРезультатовСверки
		|ИЗ
		|	&ВариантыРезультатовСверки КАК ВариантыРезультатовСверки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_БанковскиеСчетаСчетовВнутреннегоУчета.Организация КАК Организация,
		|	_БанковскиеСчетаСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_БанковскиеСчетаСчетовВнутреннегоУчета.БанковскийСчет КАК БанковскийСчет,
		|	ЕСТЬNULL(_БанковскиеСчета.РезультатСверки, _ВариантРезультатаНеСверялось.Значение) КАК РезультатСверки,
		|	ЕСТЬNULL(_ВариантыРезультатовСверки.Представление, _ВариантРезультатаНеСверялось.Представление) КАК ПредставлениеРезультата,
		|	ЕСТЬNULL(_ВариантыРезультатовСверки.Приоритет, _ВариантРезультатаНеСверялось.Приоритет) КАК ПриоритетРезультата,
		|	ЕСТЬNULL(_БанковскиеСчета.РезультатСверкиАвто, _ВариантРезультатаНеСверялось.Значение) КАК РезультатСверкиАвто,
		|	ЕСТЬNULL(_ВариантыРезультатовСверкиАвто.Представление, _ВариантРезультатаНеСверялось.Представление) КАК ПредставлениеРезультатаАвто,
		|	ЕСТЬNULL(_ВариантыРезультатовСверкиАвто.Приоритет, _ВариантРезультатаНеСверялось.Приоритет) КАК ПриоритетРезультатаАвто
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_БанковскиеСчетаСчетовВнутреннегоУчета КАК _БанковскиеСчетаСчетовВнутреннегоУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			_БанковскиеСчетаСчетовВнутреннегоУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|		ИЗ
		|			_БанковскиеСчетаСчетовВнутреннегоУчета КАК _БанковскиеСчетаСчетовВнутреннегоУчета
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ _БанковскиеСчета КАК _БанковскиеСчета
		|				ПО (_БанковскиеСчета.БанковскийСчет = _БанковскиеСчетаСчетовВнутреннегоУчета.БанковскийСчет)) КАК СвязанныеСчетаВнутреннегоУчета
		|		ПО (СвязанныеСчетаВнутреннегоУчета.СчетДоверительногоУправления = _БанковскиеСчетаСчетовВнутреннегоУчета.СчетДоверительногоУправления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _БанковскиеСчета КАК _БанковскиеСчета
		|		ПО _БанковскиеСчетаСчетовВнутреннегоУчета.БанковскийСчет = _БанковскиеСчета.БанковскийСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВариантыРезультатовСверки КАК _ВариантыРезультатовСверки
		|		ПО (_ВариантыРезультатовСверки.Значение = _БанковскиеСчета.РезультатСверки)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВариантыРезультатовСверки КАК _ВариантыРезультатовСверкиАвто
		|		ПО (_ВариантыРезультатовСверкиАвто.Значение = _БанковскиеСчета.РезультатСверкиАвто)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ВариантыРезультатовСверки КАК _ВариантРезультатаНеСверялось
		|		ПО (_ВариантРезультатаНеСверялось.Значение = &РезультатНеСверялось)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ИтоговаяТаблица.Организация КАК Организация,
		|	_ИтоговаяТаблица.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ИтоговаяТаблица.БанковскийСчет КАК БанковскийСчет,
		|	ПРЕДСТАВЛЕНИЕ(_ИтоговаяТаблица.БанковскийСчет) КАК БанковскийСчетПредставление,
		|	_ИтоговаяТаблица.РезультатСверки КАК РезультатСверки,
		|	_ИтоговаяТаблица.ПредставлениеРезультата КАК ПредставлениеРезультата,
		|	_ИтоговаяТаблица.ПриоритетРезультата КАК ПриоритетРезультата,
		|	_ИтоговаяТаблица.РезультатСверкиАвто КАК РезультатСверкиАвто,
		|	_ИтоговаяТаблица.ПредставлениеРезультатаАвто КАК ПредставлениеРезультатаАвто,
		|	_ИтоговаяТаблица.ПриоритетРезультатаАвто КАК ПриоритетРезультатаАвто,
		|	ПриоритетРезультатовПоСчетуДоверительногоУправления.ПриоритетРезультата КАК ПриоритетРезультатаПоСчетуДоверительногоУправления,
		|	ИСТИНА КАК Пройдена
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ИтоговаяТаблица.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|			МИНИМУМ(_ИтоговаяТаблица.ПриоритетРезультата) КАК ПриоритетРезультата
		|		ИЗ
		|			_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_ИтоговаяТаблица.СчетДоверительногоУправления) КАК ПриоритетРезультатовПоСчетуДоверительногоУправления
		|		ПО (ПриоритетРезультатовПоСчетуДоверительногоУправления.СчетДоверительногоУправления = _ИтоговаяТаблица.СчетДоверительногоУправления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриоритетРезультатаПоСчетуДоверительногоУправления,
		|	СчетДоверительногоУправления,
		|	ПриоритетРезультата,
		|	ПриоритетРезультатаАвто,
		|	БанковскийСчет
		|ИТОГИ
		|	МИНИМУМ(Организация),
		|	МИНИМУМ(РезультатСверки),
		|	МИНИМУМ(ПредставлениеРезультата),
		|	МИНИМУМ(РезультатСверкиАвто),
		|	МИНИМУМ(ПредставлениеРезультатаАвто),
		|	МИНИМУМ(Пройдена)
		|ПО
		|	ПриоритетРезультатаПоСчетуДоверительногоУправления,
		|	СчетДоверительногоУправления,
		|	ПриоритетРезультата,
		|	ПриоритетРезультатаАвто
		|АВТОУПОРЯДОЧИВАНИЕ");		
	
	ВариантыРезультатовСверки = Новый ТаблицаЗначений;
	ВариантыРезультатовСверки.Колонки.Добавить("Значение",		Новый ОписаниеТипов("Число"));
	ВариантыРезультатовСверки.Колонки.Добавить("Представление",	Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
	ВариантыРезультатовСверки.Колонки.Добавить("Приоритет",		Новый ОписаниеТипов("Число"));
	ВариантыРезультатовСверки.Колонки.Добавить("ЦветТекста",	Новый ОписаниеТипов("Строка"));
	
	Для Каждого ВариантРезультата Из ОписаниеРезультатовСверки Цикл
		ЗаполнитьЗначенияСвойств(ВариантыРезультатовСверки.Добавить(), ВариантРезультата.Значение);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Организация",			   Объект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода",			   Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",			   Объект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("БанковскиеСчета",		   Объект.БанковскиеСчета.Выгрузить());
	
	Запрос.УстановитьПараметр("ВариантыРезультатовСверки", ВариантыРезультатовСверки);
	Запрос.УстановитьПараметр("РезультатСверено",		   ОписаниеРезультатовСверки.Сверено.Значение);
	Запрос.УстановитьПараметр("РезультатНеСверялось",	   ОписаниеРезультатовСверки.НеСверялось.Значение);
	
	Запрос.УстановитьПараметр("ИсключитьСчетаУчетКоторыхВедетсяВДругойСистеме", Объект.ИсключитьСчетаУчетКоторыхВедетсяВДругойСистеме);
	Запрос.УстановитьПараметр("КодыИсключаемыхПортфелей",						РаботаСКоллекциями.ЗначениеВМассив("О")); // НЕОПРЕДЕЛЁН
	
	#КонецОбласти
	
	ВыборкаПоРезультатуПоСчетуДУ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоРезультатуПоСчетуДУ.Следующий() Цикл
	
		ВыборкаПоСчетуДУ = ВыборкаПоРезультатуПоСчетуДУ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		
		Пока ВыборкаПоСчетуДУ.Следующий() Цикл
			
			СтрокаСверки = ЭтаФорма.СчетаВнутреннегоУчета.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаСверки, ВыборкаПоСчетуДУ); 
			
			// Вычисляем результат сверки счета д/у и заполняем расшифровку расхождений

			РасшифровкаРасхождений = Новый Соответствие;
			
			ВыборкаПоРезультату = ВыборкаПоСчетуДУ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоРезультату.Следующий() Цикл
				
				Если ВыборкаПоРезультату.РезультатСверки <> ОписаниеРезультатовСверки.Сверено.Значение Тогда
					СтрокаСверки.Пройдена = Ложь;
				КонецЕсли;
				
				ВыборкаПоРезультатуАвто = ВыборкаПоРезультату.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоРезультатуАвто.Следующий() Цикл
					
					Если ВыборкаПоРезультатуАвто.РезультатСверки <> ВыборкаПоРезультатуАвто.РезультатСверкиАвто Тогда
						СтрокаСверки.РучнойРежим = Истина;
					КонецЕсли;
					
					Если ВыборкаПоРезультатуАвто.РезультатСверки = ОписаниеРезультатовСверки.Сверено.Значение
						И ВыборкаПоРезультатуАвто.РезультатСверкиАвто <> ОписаниеРезультатовСверки.Сверено.Значение
					Тогда
						ПредставлениеРезультата = "Сверено вручную";
					ИначеЕсли ВыборкаПоРезультатуАвто.РезультатСверки <> ОписаниеРезультатовСверки.Сверено.Значение Тогда
						ПредставлениеРезультата = ВыборкаПоРезультатуАвто.ПредставлениеРезультата;		
					Иначе
						Прервать;
					КонецЕсли;
					
					БанковскиеСчета = РасшифровкаРасхождений.Получить(ПредставлениеРезультата);
					Если БанковскиеСчета = Неопределено Тогда
						БанковскиеСчета = Новый Массив;
						РасшифровкаРасхождений.Вставить(ПредставлениеРезультата, БанковскиеСчета);
					КонецЕсли;
					
					ВыборкаПоБанковскомуСчету = ВыборкаПоРезультатуАвто.Выбрать();
					Пока ВыборкаПоБанковскомуСчету.Следующий() Цикл
						БанковскиеСчета.Добавить(ВыборкаПоБанковскомуСчету.БанковскийСчетПредставление);
					КонецЦикла;
					
				КонецЦикла;
					
			КонецЦикла;
			
			СтрокаСверки.ПройденаАвто			= СтрокаСверки.Пройдена;
			СтрокаСверки.РучнойРежимАвто		= СтрокаСверки.РучнойРежим;
			СтрокаСверки.РасшифровкаРасхождений	= Новый ФиксированноеСоответствие(РасшифровкаРасхождений);
			
			ЗаполнитьПримечание(СтрокаСверки);
			
		КонецЦикла;	

	КонецЦикла;	
	
	ПересчитатьИтогиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СкрытьРанееСверенныеНаСервере()
	
	ОтборСтрок = Неопределено;
	
	Если ЭтаФорма.СкрытьРанееСверенные Тогда
		
		#Область Запрос_ранее_сверенных_счетов_внутреннего_учета
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СверяемыеСчета.Организация КАК Организация,
			|	СверяемыеСчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ПОМЕСТИТЬ _СверяемыеСчета
			|ИЗ
			|	&СверяемыеСчета КАК СверяемыеСчета
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Организация,
			|	СчетДоверительногоУправления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_СверяемыеСчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ИЗ
			|	_СверяемыеСчета КАК _СверяемыеСчета
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналСверокПоВнутреннемуУчету КАК ЖурналСверок
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ЖурналСверок.Организация КАК Организация,
			|				ЖурналСверок.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|				ЖурналСверок.ПериодСверки КАК ПериодСверки,
			|				ЖурналСверок.Основание КАК Основание,
			|				МАКСИМУМ(ЖурналСверок.Период) КАК Период
			|			ИЗ
			|				РегистрСведений.ЖурналСверокПоВнутреннемуУчету КАК ЖурналСверок
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СверяемыеСчета КАК _СверяемыеСчета
			|					ПО ЖурналСверок.Организация = _СверяемыеСчета.Организация
			|						И ЖурналСверок.СчетДоверительногоУправления = _СверяемыеСчета.СчетДоверительногоУправления
			|						И (ЖурналСверок.Основание = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.СводныйОтчетОбОстаткахНаБанковскихСчетах))
			|						И (ЖурналСверок.ПериодСверки МЕЖДУ &НачалоПериода И &КонецПериода)
			|						И (ЖурналСверок.Период <= &ВремяСверки)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ЖурналСверок.Организация,
			|				ЖурналСверок.СчетДоверительногоУправления,
			|				ЖурналСверок.ПериодСверки,
			|				ЖурналСверок.Основание) КАК ИзмененияЖурналаСверок
			|			ПО ЖурналСверок.Организация = ИзмененияЖурналаСверок.Организация
			|				И ЖурналСверок.СчетДоверительногоУправления = ИзмененияЖурналаСверок.СчетДоверительногоУправления
			|				И ЖурналСверок.ПериодСверки = ИзмененияЖурналаСверок.ПериодСверки
			|				И ЖурналСверок.Основание = ИзмененияЖурналаСверок.Основание
			|				И ЖурналСверок.Период = ИзмененияЖурналаСверок.Период
			|		ПО (ЖурналСверок.Организация = _СверяемыеСчета.Организация)
			|			И (ЖурналСверок.СчетДоверительногоУправления = _СверяемыеСчета.СчетДоверительногоУправления)
			|			И (ЖурналСверок.Пройдена)");
		
		Запрос.УстановитьПараметр("НачалоПериода",	Объект.Период.ДатаНачала);
		Запрос.УстановитьПараметр("КонецПериода",	Объект.Период.ДатаОкончания);
		Запрос.УстановитьПараметр("ВремяСверки",	ЭтаФорма.ВремяСверки);
		Запрос.УстановитьПараметр("СверяемыеСчета",	ЭтаФорма.СчетаВнутреннегоУчета.Выгрузить(Неопределено, "Организация, СчетДоверительногоУправления"));
		
		#КонецОбласти 
		
		РанееСверенные = Запрос.Выполнить().Выгрузить();
		РанееСверенные.Индексы.Добавить("СчетДоверительногоУправления");
		
		Для каждого СтрокаСверки Из ЭтаФорма.СчетаВнутреннегоУчета Цикл
			СтрокаСверки.РанееСверен = (РанееСверенные.Найти(СтрокаСверки.СчетДоверительногоУправления, "СчетДоверительногоУправления") <> Неопределено);
		КонецЦикла; 
		
		ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("РанееСверен", Ложь));	
		
	КонецЕсли;
	
	Элементы.СчетаВнутреннегоУчета.ОтборСтрок = ОтборСтрок;
	
	ПересчитатьИтогиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРезультатыСверкиНаСервере()
	
	НачатьТранзакцию();	
	
	Для Каждого РезультатСверки Из СчетаВнутреннегоУчета Цикл
		
		Если ЭтаФорма.СкрытьРанееСверенные И РезультатСверки.РанееСверен Тогда
			Продолжить;
		КонецЕсли;
		
		РегистрыСведений.ЖурналСверокПоВнутреннемуУчету.ЗафиксироватьРезультатСверки(
			РезультатСверки.Организация,
			РезультатСверки.СчетДоверительногоУправления,
			Объект.Период.ДатаНачала,
			Справочники.ВнешниеСистемы.СводныйОтчетОбОстаткахНаБанковскихСчетах,
			РезультатСверки.Пройдена,
			РезультатСверки.РучнойРежим,
			ВремяСверки,
			РезультатСверки.Примечание);
	
	КонецЦикла;
		
	ЗафиксироватьТранзакцию();	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполнитьПримечание(СтрокаСверки)
	
	СтрокаСверки.Примечание = "";
	
	Для каждого РасшифровкаРасхождений Из СтрокаСверки.РасшифровкаРасхождений Цикл
		
		Если СтрокаСверки.Пройдена И СтрокаСверки.РучнойРежим Тогда
			
			СтрокаСверки.Примечание	= ?(ПустаяСтрока(СтрокаСверки.Примечание), "Сверено вручную: ", СтрокаСверки.Примечание + ", ")
				+ СтрСоединить(РасшифровкаРасхождений.Значение, ", ");			
				
		ИначеЕсли СтрокаСверки.Пройдена ИЛИ РасшифровкаРасхождений.Ключ <> "Сверено вручную" Тогда 
		
			СтрокаСверки.Примечание	= ?(ПустаяСтрока(СтрокаСверки.Примечание), "", СтрокаСверки.Примечание + "; ")
				+ РасшифровкаРасхождений.Ключ + ": " + СтрСоединить(РасшифровкаРасхождений.Значение, ", ");
				
		КонецЕсли;		
				
	КонецЦикла; 
	
КонецФункции

&НаСервере
Функция ПересчитатьИтогиНаСервере()
	
	ЭтаФорма.ИтогоСверено	= 0;
	ЭтаФорма.ИтогоНеСверено = 0;
	
	Для каждого СтрокаСверки Из ЭтаФорма.СчетаВнутреннегоУчета Цикл
		
		Если ЭтаФорма.СкрытьРанееСверенные И СтрокаСверки.РанееСверен Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаСверки.Пройдена Тогда
			ЭтаФорма.ИтогоСверено = ЭтаФорма.ИтогоСверено + 1;
		Иначе
			ЭтаФорма.ИтогоНеСверено = ЭтаФорма.ИтогоНеСверено + 1;
		КонецЕсли;
				
	КонецЦикла; 
	
КонецФункции

&НаКлиенте
Процедура ИзменитьФлажки(Значение)
	
	ТекущаяТаблица	= ЭтаФорма.Элементы["СчетаВнутреннегоУчета"];
	
	Если ТекущаяТаблица.ВыделенныеСтроки.Количество() > 1 Тогда
		
		Для Каждого ВыделеннаяСтрока Из ТекущаяТаблица.ВыделенныеСтроки Цикл
			
			СтрокаСверки = ЭтаФорма.СчетаВнутреннегоУчета.НайтиПоИдентификатору(ВыделеннаяСтрока);
			
			СтрокаСверки.Пройдена	 = Значение;
			СтрокаСверки.РучнойРежим = (СтрокаСверки.Пройдена <> СтрокаСверки.ПройденаАвто ИЛИ СтрокаСверки.РучнойРежимАвто);
			
			ЗаполнитьПримечание(СтрокаСверки);
			
		КонецЦикла;   
		
	Иначе 
		
		Для Каждого СтрокаСверки Из ЭтаФорма.СчетаВнутреннегоУчета Цикл
			
			СтрокаСверки.Пройдена	 = Значение;
			СтрокаСверки.РучнойРежим = (СтрокаСверки.Пройдена <> СтрокаСверки.ПройденаАвто ИЛИ СтрокаСверки.РучнойРежимАвто);
			
			ЗаполнитьПримечание(СтрокаСверки);

		КонецЦикла;		
		
	КонецЕсли;	   
	
КонецПроцедуры

#КонецОбласти
